openthread/openthread/examples/platforms/nrf528xx/src/radio.c
    return (uint16_t)(diff / OT_US_PER_TEN_SYMBOLS);
}
#endif

void nrf_802154_tx_ack_started(uint8_t *p_data)
{
    // Check if the frame pending bit is set in ACK frame.
    sAckedWithFramePending = p_data[FRAME_PENDING_OFFSET] & FRAME_PENDING_BIT;

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    // Update IE and secure Enh-ACK.
#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (sCslPeriod > 0)
    {
        otRadioFrame ackFrame;
        ackFrame.mPsdu   = (uint8_t *)(p_data + 1);
        ackFrame.mLength = p_data[0];
        otMacFrameSetCslIe(&ackFrame, sCslPeriod, getCslPhase());
    }
#endif

    txAckProcessSecurity(p_data);
#endif
}

void nrf_802154_transmitted_timestamp_raw(const uint8_t *aFrame,
                                          uint8_t *      aAckPsdu,
                                          int8_t         aPower,
                                          uint8_t        aLqi,
                                          uint32_t       ack_time)
{
    assert(aFrame == sTransmitPsdu);

    if (aAckPsdu == NULL)
    {
        sAckFrame.mPsdu = NULL;
    }
    else
    {
        uint32_t offset =
            (int32_t)otPlatAlarmMicroGetNow() - (int32_t)nrf_802154_first_symbol_timestamp_get(ack_time, aAckPsdu[0]);

        sAckFrame.mInfo.mRxInfo.mTimestamp = nrf5AlarmGetCurrentTime() - offset;
        sAckFrame.mPsdu                    = &aAckPsdu[1];
        sAckFrame.mLength                  = aAckPsdu[0];
        sAckFrame.mInfo.mRxInfo.mRssi      = aPower - sLnaGain;
        sAckFrame.mInfo.mRxInfo.mLqi       = aLqi;
        sAckFrame.mChannel                 = nrf_802154_channel_get();
    }

    setPendingEvent(kPendingEventFrameTransmitted);
}

void nrf_802154_transmit_failed(const uint8_t *aFrame, nrf_802154_tx_error_t error)
{
    assert(aFrame == sTransmitPsdu);

    switch (error)
    {
    case NRF_802154_TX_ERROR_BUSY_CHANNEL:
    case NRF_802154_TX_ERROR_TIMESLOT_ENDED:
    case NRF_802154_TX_ERROR_ABORTED:
    case NRF_802154_TX_ERROR_TIMESLOT_DENIED:
        setPendingEvent(kPendingEventChannelAccessFailure);
        break;

    case NRF_802154_TX_ERROR_INVALID_ACK:
    case NRF_802154_TX_ERROR_NO_ACK:
    case NRF_802154_TX_ERROR_NO_MEM:
        setPendingEvent(kPendingEventInvalidOrNoAck);
        break;

    default:
        assert(false);
    }
}

void nrf_802154_energy_detected(uint8_t result)
{
    sEnergyDetected = nrf_802154_dbm_from_energy_level_calculate(result) - sLnaGain;

    setPendingEvent(kPendingEventEnergyDetected);
}

int8_t otPlatRadioGetReceiveSensitivity(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return NRF528XX_RECEIVE_SENSITIVITY;
}

#if OPENTHREAD_CONFIG_MAC_HEADER_IE_SUPPORT
void nrf_802154_tx_started(const uint8_t *aFrame)
{
    bool processSecurity = false;
    assert(aFrame == sTransmitPsdu);

    // Update IE and secure transmit frame
#if OPENTHREAD_CONFIG_TIME_SYNC_ENABLE
    if (sTransmitFrame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset != 0)
    {
        uint8_t *timeIe = sTransmitFrame.mPsdu + sTransmitFrame.mInfo.mTxInfo.mIeInfo->mTimeIeOffset;
        uint64_t time   = otPlatTimeGet() + sTransmitFrame.mInfo.mTxInfo.mIeInfo->mNetworkTimeOffset;

        *timeIe = sTransmitFrame.mInfo.mTxInfo.mIeInfo->mTimeSyncSeq;

        *(++timeIe) = (uint8_t)(time & 0xff);
        for (uint8_t i = 1; i < sizeof(uint64_t); i++)
        {
            time        = time >> 8;
            *(++timeIe) = (uint8_t)(time & 0xff);
        }

        processSecurity = true;
    }
#endif // OPENTHREAD_CONFIG_TIME_SYNC_ENABLE

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
    if (sCslPeriod > 0)
    {
        otMacFrameSetCslIe(&sTransmitFrame, (uint16_t)sCslPeriod, getCslPhase());
    }
#endif

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
    otEXPECT(otMacFrameIsSecurityEnabled(&sTransmitFrame) && otMacFrameIsKeyIdMode1(&sTransmitFrame) &&
             !sTransmitFrame.mInfo.mTxInfo.mIsSecurityProcessed);

    sTransmitFrame.mInfo.mTxInfo.mAesKey = &sCurrKey;

    if (!sTransmitFrame.mInfo.mTxInfo.mIsARetx)
    {
        otMacFrameSetKeyId(&sTransmitFrame, sKeyId);
        otMacFrameSetFrameCounter(&sTransmitFrame, sMacFrameCounter++);
    }

    processSecurity = true;
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

    otEXPECT(processSecurity);
    otMacFrameProcessTransmitAesCcm(&sTransmitFrame, &sExtAddress);

exit:
    return;
}
#endif

void nrf_802154_random_init(void)
{
    // Intentionally empty
}

void nrf_802154_random_deinit(void)
{
    // Intentionally empty
}

uint32_t nrf_802154_random_get(void)
{
    return otRandomNonCryptoGetUint32();
}

uint64_t otPlatRadioGetNow(otInstance *aInstance)
{
    OT_UNUSED_VARIABLE(aInstance);

    return otPlatTimeGet();
}

#if OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2
void otPlatRadioSetMacKey(otInstance *    aInstance,
                          uint8_t         aKeyIdMode,
                          uint8_t         aKeyId,
                          const otMacKey *aPrevKey,
                          const otMacKey *aCurrKey,
                          const otMacKey *aNextKey)
{
    OT_UNUSED_VARIABLE(aInstance);
    OT_UNUSED_VARIABLE(aKeyIdMode);

    assert(aPrevKey != NULL && aCurrKey != NULL && aNextKey != NULL);

    CRITICAL_REGION_ENTER();

    sKeyId = aKeyId;
    memcpy(sPrevKey.m8, aPrevKey->m8, OT_MAC_KEY_SIZE);
    memcpy(sCurrKey.m8, aCurrKey->m8, OT_MAC_KEY_SIZE);
    memcpy(sNextKey.m8, aNextKey->m8, OT_MAC_KEY_SIZE);

    CRITICAL_REGION_EXIT();
}

void otPlatRadioSetMacFrameCounter(otInstance *aInstance, uint32_t aMacFrameCounter)
{
    OT_UNUSED_VARIABLE(aInstance);

    CRITICAL_REGION_ENTER();

    sMacFrameCounter = aMacFrameCounter;

    CRITICAL_REGION_EXIT();
}
#endif // OPENTHREAD_CONFIG_THREAD_VERSION >= OT_THREAD_VERSION_1_2

#if OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
static void updateIeData(otInstance *aInstance, const uint8_t *aShortAddr, const uint8_t *aExtAddr)
{
    int8_t  offset = 0;
    uint8_t ackIeData[OT_ACK_IE_MAX_SIZE];

    if (sCslPeriod > 0)
    {
        memcpy(ackIeData, sCslIeHeader, OT_IE_HEADER_SIZE);
        offset += OT_IE_HEADER_SIZE + OT_CSL_IE_SIZE; // reserve space for CSL IE
    }

    if (offset > 0)
    {
        nrf_802154_ack_data_set(aShortAddr, false, ackIeData, offset, NRF_802154_ACK_DATA_IE);
        nrf_802154_ack_data_set(aExtAddr, true, ackIeData, offset, NRF_802154_ACK_DATA_IE);
    }
    else
    {
        nrf_802154_ack_data_clear(aShortAddr, false, NRF_802154_ACK_DATA_IE);
        nrf_802154_ack_data_clear(aExtAddr, true, NRF_802154_ACK_DATA_IE);
    }
}

otError otPlatRadioEnableCsl(otInstance *aInstance, uint32_t aCslPeriod, const otExtAddress *aExtAddr)
{
    otError        error = OT_ERROR_NONE;
    uint8_t        parentExtAddr[OT_EXT_ADDRESS_SIZE];
    uint8_t        parentShortAddress[SHORT_ADDRESS_SIZE];
    const uint8_t *shortAddress;

    sCslPeriod = aCslPeriod;

    for (uint32_t i = 0; i < sizeof(parentExtAddr); i++)
    {
        parentExtAddr[i] = aExtAddr->m8[sizeof(parentExtAddr) - i - 1];
    }

    shortAddress = nrf_802154_pib_short_address_get();
    memcpy(parentShortAddress, shortAddress, SHORT_ADDRESS_SIZE);
    parentShortAddress[0] &= 0xfc;

    updateIeData(aInstance, parentShortAddress, parentExtAddr);

    return error;
}

void otPlatRadioUpdateCslSampleTime(otInstance *aInstance, uint32_t aCslSampleTime)
{
    OT_UNUSED_VARIABLE(aInstance);

    sCslSampleTime = aCslSampleTime;
}
#endif // OPENTHREAD_CONFIG_MAC_CSL_RECEIVER_ENABLE
